#include  <stdio.h>         //鏂囦欢鍖呭惈,澶存枃浠惰鏄?
	
#define   SUM   65535       //瀹氫箟绗﹀彿甯搁噺SUM锛屽€间负65535
	
int main()
{
  int a, b = 20;            //瀹氫箟涓や釜鏁村瀷鍨嬪彉閲廰鍜宐锛宐璧嬪垵鍊?0
  unsigned int c = 0xff;    //瀹氫箟鏃犵鍙锋暣鍨嬪彉閲廲锛屽苟璧嬪垵鍊?xff
  short int d;              //瀹氫箟鏈夌鍙风煭鏁村瀷鍙橀噺d
  long e;                   //瀹氫箟鏈夌鍙烽暱鏁村瀷鍙橀噺e
	
  a = SUM;                  //瀵筧璧嬪€间负SUM锛岃繖鏃禷鐨勫€兼槸65535
  d = SUM;                  //瀵筪璧嬪€间负SUM锛岃繖鏃禿鐨勫€兼槸65535
  e = 301;                  //瀵筫璧嬪€间负301
	     
  printf("a = %d\n", a);     //浠ユ湁绗﹀彿鍗佽繘鍒跺舰寮忥紙"%d"锛夋樉绀篴鐨勫€?
  printf("b = %d\n", b);     //浠ユ湁绗﹀彿鍗佽繘鍒跺舰寮忥紙"%d"锛夋樉绀篵鐨勫€?
  printf("c = %d\n", c);     //浠ユ湁绗﹀彿鍗佽繘鍒跺舰寮忥紙"%d"锛夋樉绀篶鐨勫€?
  printf("d = %d\n", d);     //浠ユ湁绗﹀彿鍗佽繘鍒跺舰寮忥紙"%d"锛夋樉绀篸鐨勫€?
  printf("e = %d\n", e);     //浠ユ湁绗﹀彿鍗佽繘鍒跺舰寮忥紙"%d"锛夋樉绀篹鐨勫€?
  return 0;
}

